tap "antoniorodr/memo"
tap "steipete/tap"
tap "yakitrak/yakitrak"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# GNU data recovery tool
brew "ddrescue"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Isolated development environments using Docker
brew "docker-compose"
# Access DVDs as block devices without the decryption
brew "libdvdcss"
# Rip DVD's from the command-line
brew "dvdbackup"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# General-purpose speech recognition model
brew "openai-whisper"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Command-line interface for Eclipse Open VSX
brew "ovsx"
# Rust toolchain installer
brew "rustup"
# Fast, configurable, shell plugin manager
brew "sheldon"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terminal multiplexer
brew "tmux"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# CLI app to manage your Apple Notes and Apple reminders
brew "antoniorodr/memo/memo"
# One command to grab frames, clips, or motion alerts from RTSP/ONVIF cams
brew "steipete/tap/camsnap"
# Grep the GIF. Stick the landing
brew "steipete/tap/gifgrep"
# Google CLI for Gmail, Calendar, Drive, and Contacts
brew "steipete/tap/gogcli"
# Modern Go client + CLI for the Google Places API (New)
brew "steipete/tap/goplaces"
# Send and read iMessage / SMS from the terminal
brew "steipete/tap/imsg"
# Fast CLI for Apple Reminders
brew "steipete/tap/remindctl"
# Command-line ElevenLabs TTS with mac-style flags
brew "steipete/tap/sag"
# Link → clean text → summary
brew "steipete/tap/summarize"
# WhatsApp CLI built on whatsmeow
brew "steipete/tap/wacli"
brew "yakitrak/yakitrak/obsidian-cli"
# Command-line interface for 1Password
cask "1password-cli"
# AI dictation app
cask "amical"
# AI Coding Agent IDE
cask "antigravity"
# 3D creation suite
cask "blender"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Write, edit, and chat about your code with AI
cask "cursor"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Japanese input software
cask "google-japanese-ime"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Video format converter (transcoder)
cask "makemkv"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Team communication and collaboration software
cask "slack"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Video communication and virtual meeting platform
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "esbenp.prettier-vscode"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "janisdd.vscode-edit-csv"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "pkief.material-icon-theme"
vscode "shardulm94.trailing-spaces"
vscode "temple-slope.copy-path-line"
vscode "tomoki1207.pdf"
vscode "vscodevim.vim"
vscode "yzane.markdown-pdf"
